# Filtering and Ordering - Lab

## Introduction
In this lab, you will write more `SELECT` statements to solidify your ability to query a SQL database. You will also write more specific queries using the tools you learned in the previous lesson.

## Objectives
You will be able to:
* Limit the number of records returned by a query using `LIMIT`
* Filter results using `BETWEEN` and `IS NULL`
* Order the results of your queries by using `ORDER BY` (`ASC` & `DESC`)

### Famous Dogs

Here's a database full of famous dogs!  The `dogs` table is populated with the following data:

|name      |age    |gender |breed           |temperament|hungry |
|----------|-------|-------|----------------|-----------|-------|
|Snoopy    |3      |M      |beagle          |friendly   |1      |
|McGruff   |10     |M      |bloodhound      |aware      |0      |
|Scooby    |6      |M      |great dane      |hungry     |1      |
|Little Ann|5      |F      |coonhound       |loyal      |0      |
|Pickles   |13     |F      |black lab       |mischievous|1      |
|Clifford  |4      |M      |big red         |smiley     |1      |
|Lassie    |7      |F      |collie          |loving     |1      |
|Snowy     |8      |F      |fox terrier     |adventurous|0      |
|NULL      |4      |M      |golden retriever|playful    |1      |

## Connecting to the Database

First, import sqlite3 and establish a connection to the database **dogs.db**. Then, create a cursor object so that you can pass SQL queries to the database.

In [2]:
import sqlite3
conn = sqlite3.connect('dogs.db')
c = conn.cursor()

import pandas as pd

In [6]:
c.execute("""SELECT * FROM dogs;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   id        name  age gender             breed  temperament  hungry
0   1      Snoopy    3      M            beagle     friendly       1
1   2     McGruff   10      M        bloodhound        aware       0
2   3      Scooby    6      M        great dane       hungry       1
3   4  Little Ann    5      F         coonhound        loyal       0
4   5     Pickles   13      F         black lab  mischievous       1
5   6    Clifford    4      M           big red       smiley       1
6   7      Lassie    7      F            collie       loving       1
7   8       Snowy    8      F       fox terrier  adventurous       0
8   9        None    4      M  golden retriever      playful       1

In [ ]:
#Your code here; import sqlite, create a connection and then a cursor object.

## Queries

Display the outputs for each of the following query descriptions.

* Select the name and breed for all female dogs

In [10]:
c.execute("""SELECT name, breed FROM dogs WHERE (gender = 'F')""").fetchall()

[('Little Ann', 'coonhound'),
 ('Pickles', 'black lab'),
 ('Lassie', 'collie'),
 ('Snowy', 'fox terrier')]

* Select the names of all dogs listed in alphabetical order.  Notice that SQL lists the nameless dog first.

In [13]:
c.execute("""SELECT name FROM dogs ORDER BY name asc""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

         name
0        None
1    Clifford
2      Lassie
3  Little Ann
4     McGruff
5     Pickles
6      Scooby
7      Snoopy
8       Snowy

* Select any dog that doesn't have a name

In [14]:
c.execute("""SELECT * FROM dogs WHERE name is null""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   id  name  age gender             breed temperament  hungry
0   9  None    4      M  golden retriever     playful       1

* Select the name and breed of only the hungry dogs and lists them from youngest to oldest

In [21]:
c.execute("""SELECT name, breed, age FROM dogs WHERE hungry = 1 ORDER BY age ASC""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

       name             breed  age
0    Snoopy            beagle    3
1  Clifford           big red    4
2      None  golden retriever    4
3    Scooby        great dane    6
4    Lassie            collie    7
5   Pickles         black lab   13

* Select the oldest dog's name, age, and temperament

In [31]:
c.execute("""SELECT name, age, temperament FROM dogs ORDER BY age DESC LIMIT 1""").fetchall()

[('Pickles', 13, 'mischievous')]

* Select the three youngest dogs

In [34]:
c.execute("""SELECT * FROM dogs ORDER BY age ASC LIMIT 3""").fetchall()

[(1, 'Snoopy', 3, 'M', 'beagle', 'friendly', 1),
 (6, 'Clifford', 4, 'M', 'big red', 'smiley', 1),
 (9, None, 4, 'M', 'golden retriever', 'playful', 1)]

* Select the name and breed of only the dogs who are between five and ten years old

In [36]:
c.execute("""SELECT name, breed, age FROM dogs WHERE age BETWEEN 5 and 10""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

         name        breed  age
0     McGruff   bloodhound   10
1      Scooby   great dane    6
2  Little Ann    coonhound    5
3      Lassie       collie    7
4       Snowy  fox terrier    8

* Select the name, age, and hungry columns for hungry dogs between the ages of two and seven.  This query should also list these dogs in alphabetical order.

In [39]:
1 == True

True

In [40]:
c.execute("""SELECT name, age, hungry 
FROM dogs WHERE (hungry = 1) (age BETWEEN 2 and 7) ORDER BY name ASC""").fetchall()

OperationalError: near "(": syntax error

## Summary

Great work! In this lab you practiced writing more complex SQL statements to not only query specific information but also define the quantity of results and the order of your results.